system/sampleDict.cfg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

interpolationScheme cellPoint;

setFormat   raw;

setConfig
{
    type    uniform;   // midPoint, midPointAndFace
    axis    distance;  // x, y, z, xyz
    nPoints 100;
}

// ************************************************************************* //
